### Week 1 Homework
##### Angela Spencer - 12/8/2021

#### 1.	What scale of measurement applies to timeseries data? Is timeseries data continuous or discrete? Why?

Timeseries data is measured in an interval scale, it is numeric and the values have specific order and spacing such as hours, days, or years. Timeseries data is usually discrete because observations are made at specific intervals rather than constantly.

#### 2.	What does ARIMA stand for? Break down and explain each piece in the name.

ARIMA stands for AutoRegression, order of Integration, Moving Average - it is a linear regression model that performs three types of analysis on the data:
-Autoregression: uses past events to predict future ones by finding correlations between lags  
-Order of Integration: used to make a series stationary
-Moving Average: creates a average value that is constantly adjusting based on new information

#### 3.	Using the data in the temperatures/ folder. Write a function that efficiently converts every column to a different temperature scale: one that is more common than Kelvin.

In [1]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt

In [2]:
#import csv as dataframe, parse date to datetime, set index to date column
kelvin_df = pd.read_csv('temperature.csv', parse_dates=True, index_col='datetime')
kelvin_df.shape

(45253, 36)

In [3]:
#drop rows with NaN values
kelvin_df_dropped = kelvin_df.dropna()
kelvin_df_dropped.shape

(44430, 36)

In [4]:
#define function that accepts df and converts kelvin values to celsius, returning a new df
celsius_conversion = round(kelvin_df_dropped.apply(lambda num: num-273.15),2)

fahrenheit_conversion = round(kelvin_df_dropped.apply(lambda x: (x-273.15)*9/5+32),2)

print(kelvin_df_dropped.iloc[0,0])
print(celsius_conversion.iloc[0,0])
print(fahrenheit_conversion.iloc[0,0])

284.63
11.48
52.66

In [5]:
celsius_conversion

,Vancouver,Portland,San Francisco,Seattle,Los Angeles,San Diego,Las Vegas,Phoenix,Albuquerque,Denver,...,Philadelphia,New York,Montreal,Boston,Beersheba,Tel Aviv District,Eilat,Haifa,Nahariyya,Jerusalem
datetime,,,,,,,,,,,,,,,,,,,,,
2012-10-01 13:00:00,11.48,8.93,16.33,8.65,18.72,18.38,20.26,23.45,11.97,11.46,...,12.48,15.07,12.68,14.02,34.44,32.32,37.43,31.25,31.25,30.35
2012-10-01 14:00:00,11.48,8.93,16.32,8.65,18.72,18.38,20.25,23.46,12.00,11.46,...,12.51,15.10,12.68,14.04,34.44,31.16,37.35,31.25,31.25,30.35
2012-10-01 15:00:00,11.48,8.94,16.31,8.64,18.71,18.39,20.24,23.48,12.08,11.45,...,12.61,15.18,12.70,14.08,34.24,31.13,37.26,31.25,31.25,30.35
2012-10-01 16:00:00,11.47,8.95,16.30,8.63,18.71,18.40,20.23,23.50,12.16,11.44,...,12.70,15.26,12.71,14.13,34.00,31.09,37.18,31.25,31.25,30.35
2012-10-01 17:00:00,11.47,8.96,16.28,8.63,18.70,18.41,20.22,23.53,12.24,11.44,...,12.79,15.34,12.72,14.17,33.75,31.04,37.09,31.25,31.25,30.35
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2017-10-27 20:00:00,13.29,20.69,23.91,13.00,26.84,26.24,25.28,29.00,11.22,4.11,...,17.45,16.83,9.97,16.59,14.43,22.56,24.00,26.40,26.40,22.61
2017-10-27 21:00:00,14.72,21.70,25.99,14.99,28.17,26.55,26.28,30.50,12.74,4.77,...,17.18,16.33,9.97,15.93,14.43,20.00,25.00,26.40,26.40,20.00
2017-10-27 22:00:00,15.27,22.42,27.41,16.29,28.45,27.01,27.41,31.33,13.25,4.87,...,15.34,14.77,8.97,14.94,14.43,21.00,24.00,26.40,26.40,21.00
2017-10-27 23:00:00,15.50,21.84,27.91,17.44,28.61,27.62,27.66,31.80,13.74,4.54,...,13.01,12.68,8.62,11.79,12.79,21.00,17.87,26.22,26.22,21.00
2017-10-28 00:00:00,14.86,21.37,28.92,17.77,28.37,27.16,27.65,31.80,12.98,3.99,...,11.73,11.83,6.95,9.86,12.79,21.00,17.87,26.22,26.22,21.00

#### 4.	Write a function that efficiently fills in missing values in every column, excluding trailing NANs. That is: if there's temperature data on either side of a timestamp, it should interpolate through it. But if data stopped being collected, your function should leave nans at the end.

In [6]:
#use .interpolate to fill non-trailing NaNs
kelvin_df_interpolate = kelvin_df.interpolate(limit_area='inside')

#print total number of NaNs in new df and before interpolation
print(kelvin_df_interpolate.isna().sum().sum())
print(kelvin_df.isna().sum().sum())

print(kelvin_df_interpolate['Montreal'].isna().sum())
print(kelvin_df['Montreal'].isna().sum())

kelvin_df_interpolate.loc[kelvin_df_interpolate['Montreal'].isna()]

7955
8030
1
3

,Vancouver,Portland,San Francisco,Seattle,Los Angeles,San Diego,Las Vegas,Phoenix,Albuquerque,Denver,...,Philadelphia,New York,Montreal,Boston,Beersheba,Tel Aviv District,Eilat,Haifa,Nahariyya,Jerusalem
datetime,,,,,,,,,,,,,,,,,,,,,
2012-10-01 12:00:00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,309.1,NaN,NaN,NaN

#### 5.	Find all cities A and B where city A is warmer than city B in the summer, but also colder than city B in the winter, on average.

In [7]:
kelvin_df.head(3)

,Vancouver,Portland,San Francisco,Seattle,Los Angeles,San Diego,Las Vegas,Phoenix,Albuquerque,Denver,...,Philadelphia,New York,Montreal,Boston,Beersheba,Tel Aviv District,Eilat,Haifa,Nahariyya,Jerusalem
datetime,,,,,,,,,,,,,,,,,,,,,
2012-10-01 12:00:00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,309.100000,NaN,NaN,NaN
2012-10-01 13:00:00,284.630000,282.080000,289.480000,281.800000,291.870000,291.530000,293.410000,296.600000,285.120000,284.610000,...,285.630000,288.220000,285.83000,287.170000,307.59,305.47,310.580000,304.4,304.4,303.5
2012-10-01 14:00:00,284.629041,282.083252,289.474993,281.797217,291.868185,291.533501,293.403141,296.608509,285.154558,284.607305,...,285.663208,288.247676,285.83465,287.186092,307.59,304.31,310.495769,304.4,304.4,303.5

#2012-10-01-12:00:00 min
#2017-11-30-00:00:00 max

#isolate summer months and winter months in unique series
summer_months = fahrenheit_conversion.loc[fahrenheit_conversion.index.month.isin([6,7,8])]
winter_months = fahrenheit_conversion.loc[fahrenheit_conversion.index.month.isin([12,1,2])]

#calculate mean of each series to find mean temperature for that season
summer_months_avg = summer_months.mean()
winter_months_avg = winter_months.mean()

#create a new dataframe with summer and winter averages
seasonal_avg_df = pd.concat(
    [summer_months_avg.rename("Summer Average"), 
     winter_months_avg.rename("Winter Average")], axis=1)
seasonal_avg_df.head(3)

In [56]:
#create a loop that compares the summer avg 
for index, col in seasonal_avg_df.iterrows():
    if seasonal_avg_df['Summer Average']

Summer Average    64.618817
Winter Average    38.753053
Name: Vancouver, dtype: float64
Summer Average    67.117580
Winter Average    40.123098
Name: Portland, dtype: float64
Summer Average    65.733608
Winter Average    51.241873
Name: San Francisco, dtype: float64
Summer Average    64.747178
Winter Average    40.742606
Name: Seattle, dtype: float64
Summer Average    72.455433
Winter Average    54.791042
Name: Los Angeles, dtype: float64
Summer Average    69.965765
Winter Average    54.690291
Name: San Diego, dtype: float64
Summer Average    88.723296
Winter Average    46.542773
Name: Las Vegas, dtype: float64
Summer Average    91.308960
Winter Average    53.564322
Name: Phoenix, dtype: float64
Summer Average    72.702141
Winter Average    35.843207
Name: Albuquerque, dtype: float64
Summer Average    69.323572
Winter Average    31.088635
Name: Denver, dtype: float64
Summer Average    82.937954
Winter Average    54.247960
Name: San Antonio, dtype: float64
Summer Average    83.791217
Winter Average    48.927651
Name: Dallas, dtype: float64
Summer Average    82.968535
Winter Average    56.016292
Name: Houston, dtype: float64
Summer Average    76.449727
Winter Average    33.862459
Name: Kansas City, dtype: float64
Summer Average    69.933067
Winter Average    18.339681
Name: Minneapolis, dtype: float64
Summer Average    76.484868
Winter Average    34.697194
Name: Saint Louis, dtype: float64
Summer Average    70.803763
Winter Average    28.123117
Name: Chicago, dtype: float64
Summer Average    77.177821
Winter Average    41.686127
Name: Nashville, dtype: float64
Summer Average    73.103110
Winter Average    31.162306
Name: Indianapolis, dtype: float64
Summer Average    77.388137
Winter Average    46.081076
Name: Atlanta, dtype: float64
Summer Average    70.696786
Winter Average    27.635431
Name: Detroit, dtype: float64
Summer Average    81.195369
Winter Average    58.598080
Name: Jacksonville, dtype: float64
Summer Average    76.802098
Winter Average    43.958656
Name: Charlotte, dtype: float64
Summer Average    82.670907
Winter Average    70.944587
Name: Miami, dtype: float64
Summer Average    70.382973
Winter Average    31.803618
Name: Pittsburgh, dtype: float64
Summer Average    68.171434
Winter Average    27.039898
Name: Toronto, dtype: float64
Summer Average    73.487241
Winter Average    34.546114
Name: Philadelphia, dtype: float64
Summer Average    73.654598
Winter Average    34.061703
Name: New York, dtype: float64
Summer Average    67.527687
Winter Average    20.400462
Name: Montreal, dtype: float64
Summer Average    70.068428
Winter Average    32.440657
Name: Boston, dtype: float64
Summer Average    76.475016
Winter Average    51.199078
Name: Beersheba, dtype: float64
Summer Average    81.410525
Winter Average    57.353867
Name: Tel Aviv District, dtype: float64
Summer Average    88.684950
Winter Average    57.473846
Name: Eilat, dtype: float64
Summer Average    82.329074
Winter Average    60.003621
Name: Haifa, dtype: float64
Summer Average    79.537521
Winter Average    57.994031
Name: Nahariyya, dtype: float64
Summer Average    79.336812
Winter Average    54.838126
Name: Jerusalem, dtype: float64

#### 6.	For two of the cities you found in question 5 (there are many possible answers), clean up the data via rolling averages and plot a clear visual. Explain how rolling average differs from moving average (MA) model.

#### 7.	Perform SARIMA on five cities, iterating through the cities programmatically. Explain your results.

#### a.	Graph the predicted values 30 days out.

#### 8.	Explain what you see when you perform results.summary() on the cities in question 7.

#### DataCamp Certificate

#### Bonus: What do GARCH and ARCH Stand for? Break down and explain each piece in the names. Explain the difference between the two. Create a GARCH and ARCH model on the same 5 cities from question 6. Explain and graph the results.